app/controllers/registrations_controller.rb

SELECT * FROM "day_of_actions" WHERE ("day_of_actions"."id" = 1)
SELECT * FROM "registrations" WHERE ("registrations".time_slot_id = 1) LIMIT 1
SELECT * FROM "time_slots" WHERE ("time_slots".day_of_action_id = 1)
---
  def new
    @day_of_action = DayOfAction.find(params[:days_of_action_id], :include => {:time_slots =>  :registration} )

SELECT * FROM "registrations" WHERE ("registrations".time_slot_id = 1) LIMIT 1
SELECT * FROM "time_slots" WHERE ("time_slots".day_of_action_id = 1)
---
  def create
    registration = Registration.new(params[:registration])
    if registration.valid?
      time_slot = TimeSlot.find(params[:registration][:time_slot_id])